In [1]:
#Dependencies and Setup
import pandas as pd
import numpy as np

#File to Load
file_to_load="./Resources/purchase_data.csv"

#Read Purchasing File and store into Pandas data frame
purchase_data=pd.read_csv(file_to_load)

In [4]:
print("Player Count")
#Display the total number of players

Player Count

In [5]:
#Count the number of unique players
player_count=len(purchase_data["SN"].unique())


print(f"The total number of players is {player_count}")

The total number of players is 576

In [6]:
print("Purchasing Analysis (Total)")

Purchasing Analysis (Total)

In [7]:
#Number of unique items
unique_items_count=len(purchase_data["Item Name"].unique())
#Average price (average price per transaction)
average_price='${:,.2f}'.format(purchase_data["Price"].mean())
#Number of purchases
number_of_purchases=purchase_data["Price"].count()
#Total revenue, as the sum of all transaction amounts
total_revenue='${:,.2f}'.format(purchase_data["Price"].sum())

In [8]:
#creating a dictionary and then converting to dataframe
purchasing_analysis_df=pd.DataFrame({"Number of Unique Items":[unique_items_count],
                                    "Average Price":[average_price],
                                    "Number of Purchases":[number_of_purchases],
                                    "Total Revenue":[total_revenue]})

In [9]:
#display the summary data frame
purchasing_analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [10]:
print("Gender Demographics")

Gender Demographics

In [11]:
#selecting "SN", and "Gender", and creating groupby object on "SN"
gender_df=purchase_data[["SN","Gender"]].groupby(["SN"])
#Using last() to avoid duplicates, and 
#then counting to get a Pandas series; also converting to dataframe
gender_counts=pd.DataFrame(gender_df["Gender"].last().value_counts())
#renaming column
gender_counts.columns=["Total Count"]
#calculating percentage of each gender
gender_counts["Percentage of Players"]=gender_counts["Total Count"]/player_count*100
#formatting percentage
gender_counts["Percentage of Players"]=gender_counts["Percentage of Players"].map('{:,.2f}'.format)
#display dataframe
gender_counts.index.name="Gender"
gender_counts

                       Total Count Percentage of Players
Gender
Male                           484                 84.03
Female                          81                 14.06
Other / Non-Disclosed           11                  1.91

In [12]:
print("Purchasing Analysis (Gender)")

Purchasing Analysis (Gender)

In [13]:
gender_analysis=purchase_data[["Gender","Price"]].groupby(["Gender"])

gender_analysis_df=pd.DataFrame({"Purchase Count":gender_analysis["Price"].count(),
                                "Total Purchase Value":gender_analysis["Price"].sum()})

gender_analysis_df["Average Purchase Price"]=gender_analysis_df["Total Purchase Value"]/gender_analysis_df["Purchase Count"]

In [14]:
gender_analysis_df

,Purchase Count,Total Purchase Value,Average Purchase Price
Gender,,,
Female,113,361.94,3.203009
Male,652,1967.64,3.017853
Other / Non-Disclosed,15,50.19,3.346000

In [15]:
gender_analysis_df=pd.merge(gender_counts,gender_analysis_df,on="Gender",how="left")

In [17]:
gender_analysis_df["Avg Total Purchase per Person"]=gender_analysis_df["Total Purchase Value"]/gender_analysis_df["Total Count"]

In [18]:
gender_analysis_df["Total Purchase Value"]=gender_analysis_df["Total Purchase Value"].map('${:,.2f}'.format)
gender_analysis_df["Average Purchase Price"]=gender_analysis_df["Average Purchase Price"].map('${:,.2f}'.format)
gender_analysis_df["Avg Total Purchase per Person"]=gender_analysis_df["Avg Total Purchase per Person"].map('${:,.2f}'.format)

,Total Count,Percentage of Players,Purchase Count,Total Purchase Value,Average Purchase Price,Avg Total Purchase per Person
Gender,,,,,,
Male,484,84.03,652,"$1,967.64",$3.02,$4.07
Female,81,14.06,113,$361.94,$3.20,$4.47
Other / Non-Disclosed,11,1.91,15,$50.19,$3.35,$4.56

In [19]:
gender_analysis_df=gender_analysis_df[["Purchase Count","Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]]

In [20]:
gender_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Male,652,$3.02,"$1,967.64",$4.07
Female,113,$3.20,$361.94,$4.47
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [40]:
print("Age Demographics")
bins = [0, 10,15,20,25,30,35,40,100]

# Create the names for the four bins
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

Age Demographics

In [41]:
age_demo_df=purchase_data.groupby(["SN","Age"],as_index=False).count()
age_demo_df=age_demo_df[["SN","Age"]]
age_demo_df["Age Group"]=pd.cut(age_demo_df["Age"],bins,labels=group_names)
age_demo_df=age_demo_df[["Age Group"]]
age_demo_df["Total Count"]=1
age_demo_df=age_demo_df.groupby("Age Group").sum()

           Total Count
Age Group
<10                 24
10-14               41
15-19              150
20-24              232
25-29               59
30-34               37
35-39               26
40+                  7

In [43]:
age_demo_df["Percentage of Players"]=age_demo_df["Total Count"]/player_count*100
age_demo_df["Percentage of Players"]=age_demo_df["Percentage of Players"].map('{:,.2f}'.format)

In [44]:
age_demo_df

           Total Count Percentage of Players
Age Group
<10                 24                  4.17
10-14               41                  7.12
15-19              150                 26.04
20-24              232                 40.28
25-29               59                 10.24
30-34               37                  6.42
35-39               26                  4.51
40+                  7                  1.22

In [45]:
print("Purchasing Analysis (Age)")

Purchasing Analysis (Age)

In [63]:
age_analysis_df=purchase_data.loc[:,["SN","Age","Price"]]
age_analysis_df["Purchase Count"]=1
age_analysis_df["Age Group"]=pd.cut(age_analysis_df["Age"],bins,labels=group_names)
age_unique_analysis_df=age_analysis_df.groupby(["SN","Age Group"]).size().reset_index()
age_unique_analysis_df=age_unique_analysis_df.groupby(["Age Group"]).count().reset_index()
age_unique_analysis_df=age_unique_analysis_df.iloc[:,[0,1]]
age_unique_analysis_df=age_unique_analysis_df.rename(columns={"SN":"Player Count"})
age_analysis_df=age_analysis_df[["SN","Age Group","Price","Purchase Count"]]
age_analysis_df=age_analysis_df.groupby(["Age Group"],as_index=False).sum()
age_analysis_df=pd.merge(age_analysis_df,age_unique_analysis_df,on="Age Group",how="left")

In [64]:
age_analysis_df["Average Purchase Price"]=age_analysis_df["Price"]/age_analysis_df["Purchase Count"]
age_analysis_df["Average Total Purchase per Person"]=age_analysis_df["Price"]/age_analysis_df["Player Count"]
age_analysis_df["Average Purchase Price"]=age_analysis_df["Average Purchase Price"].map('${:,.2f}'.format)
age_analysis_df["Price"]=age_analysis_df["Price"].map('${:,.2f}'.format)
age_analysis_df["Average Total Purchase per Person"]=age_analysis_df["Average Total Purchase per Person"].map('${:,.2f}'.format)
age_analysis_df=age_analysis_df.rename(columns={"Price":"Total Purchase Value"})
age_analysis_df=age_analysis_df.iloc[:,[0,2,4,1,5]]

In [65]:

age_analysis_df=age_analysis_df.set_index("Age Group")

In [66]:
age_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Age Group,,,,
<10,32,$3.40,$108.96,$4.54
10-14,54,$2.90,$156.60,$3.82
15-19,200,$3.11,$621.56,$4.14
20-24,325,$3.02,$981.64,$4.23
25-29,77,$2.88,$221.42,$3.75
30-34,52,$2.99,$155.71,$4.21
35-39,33,$3.40,$112.35,$4.32
40+,7,$3.08,$21.53,$3.08

In [50]:
print("Top Spenders")
top_spenders_df=purchase_data.loc[:,["SN","Price"]]
top_spenders_df["Purchase Count"]=1
top_spenders_df=top_spenders_df.groupby("SN").sum()
top_spenders_df["Average Purchase Price"]=top_spenders_df["Price"]/top_spenders_df["Purchase Count"]
top_spenders_df=top_spenders_df.rename(columns={"Price":"Total Purchase Value"})
top_spenders_df=top_spenders_df.sort_values("Total Purchase Value",ascending = False)
top_spenders_df=top_spenders_df.iloc[:,[1,2,0]]
top_spenders_df["Total Purchase Value"]=top_spenders_df["Total Purchase Value"].map('${:,.2f}'.format)
top_spenders_df["Average Purchase Price"]=top_spenders_df["Average Purchase Price"].map('${:,.2f}'.format)

Top Spenders

In [51]:
top_spenders_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [52]:
print("Most Popular Items")

Most Popular Items

In [53]:
popular_df=purchase_data.loc[:,["Item ID","Item Name","Price"]]

In [54]:
purchase_count=popular_df.groupby(["Item ID","Item Name"]).count().rename(columns={"Price":"Purchase Count"})
item_price=popular_df.groupby(["Item ID","Item Name"]).mean().rename(columns={"Price":"Item Price"})
total_purchase_value=popular_df.groupby(["Item ID","Item Name"]).sum().rename(columns={"Price":"Total Purchase Value"})

In [55]:
purchase_count.columns

Index(['Purchase Count'], dtype='object')

In [56]:
popular_df=pd.merge(purchase_count,item_price,on=(["Item ID","Item Name"]),how="left")
popular_df=pd.merge(popular_df,total_purchase_value,on=(["Item ID","Item Name"]),how="left")
popular_df=popular_df.sort_values("Purchase Count",ascending=False)
popular_df["Total Purchase Value"]=popular_df["Total Purchase Value"].map('${:,.2f}'.format)
popular_df["Item Price"]=popular_df["Item Price"].map('${:,.2f}'.format)

In [57]:
popular_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

In [58]:
print("Most Profitable Item")

Most Profitable Item

In [61]:
profitable_df=pd.merge(purchase_count,item_price,on=(["Item ID","Item Name"]),how="left")
profitable_df=pd.merge(profitable_df,total_purchase_value,on=(["Item ID","Item Name"]),how="left")
profitable_df=profitable_df.sort_values("Total Purchase Value",ascending=False)
profitable_df["Total Purchase Value"]=profitable_df["Total Purchase Value"].map('${:,.2f}'.format)
profitable_df["Item Price"]=profitable_df["Item Price"].map('${:,.2f}'.format)
profitable_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80

In [62]:
profitable_df=pd.merge(purchase_count,item_price,on=(["Item ID","Item Name"]),how="left")
profitable_df=pd.merge(profitable_df,total_purchase_value,on=(["Item ID","Item Name"]),how="left")
profitable_df=profitable_df.sort_values("Total Purchase Value",ascending=False)
profitable_df["Total Purchase Value"]=profitable_df["Total Purchase Value"].map('${:,.2f}'.format)
profitable_df["Item Price"]=profitable_df["Item Price"].map('${:,.2f}'.format)
profitable_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80